app/controllers/accounts_controller.rb

	def edit
		@account = Account.find(params[:id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

	def create
		@account = Account.new(account_params)
		if @account.valid?
			@account.save
---
INSERT INTO "accounts" ("username", "password_digest", "email", "first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

	def update
		account = Account.find(params[:id])
		if account.update(account_edit_params)
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "accounts" SET "biography" = $1, "favorite_food" = $2, "updated_at" = $3 WHERE "accounts"."id" = $4  [["biography", "I like food"], ["favorite_food", "stuffs"], ["updated_at", 2017-03-13 20:02:02 UTC], ["id", 2]]

	def destroy
		account = Account.find(params[:id])
		log_out
		account.created_events.each { |event| event.destroy }
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "accounts" WHERE "accounts"."id" = $1  [["id", 4]]