app/controllers/sessions_controller.rb

	def create
		if request.env['omniauth.auth']
			user = Account.create_with_omniauth(request.env['omniauth.auth'])
			session[:account_id] = user.id
			redirect_to root_path
		else
			account = Account.find_by(username: params[:account][:username])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."username" = $1 LIMIT $2  [["username", "testuser"], ["LIMIT", 1]]